---

C#Visual BasicVisual C++

Revit 2024 API
---
ButtonData..::..Text Property
ButtonData Class See Also Send Feedback
---

The user-visible text of the button.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public string Text { get; set; }

Visual Basic
---

    Public Property Text As String
    	Get
    	Set

Visual C++
---

    public:
    property String^ Text {
    	String^ get ();
    	void set (String^ value);
    }

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when setting the value to nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when setting the value to an empty string, or when the value contains invalid characters. |

# See Also

ButtonData Class

Autodesk.Revit.UI Namespace